
var hex_chars_table = [
  ["&Omega;","&alpha;"],["坤","kūn"],["乾","qián"],["屯","zhūn"],["蒙","méng"],["需","xū"],["訟","sòng"],["師","shī"],["比","bǐ"],["小畜","xiǎo chù"],["履","lǚ"],["泰","tài"],["否","pǐ"],["同人","tóng rén"],
  ["大有","dà yǒu"],["謙","qiān"],["豫","yù"],["隨","suí"],["蠱","gŭ"],["臨","lín"],["觀","guān"],["噬嗑","shì kè"],["賁","bì"],["剝","bō"],["復","fù"],["無妄","wú wàng"],["大畜","dà chù"],["頤","yí"],["大過","dà guò"],
  ["坎","kǎn"],["離","lí"],["咸","xián"],["恆","héng"],["遯","dùn"],["大壯","dà zhuàng"],["晉","jìn"],["明夷","míng yí"],["家人","jiā rén"],["睽","kuí"],["蹇","jiǎn"],["解","xiè"],["損","sǔn"],["益","yì"],["夬","guài"],
  ["姤","gòu"],["萃","cuì"],["升","shēng"],["困","kùn"],["井","jǐng"],["革","gé"],["鼎","tǐng"],["震","zhèn"],["艮","gèn"],["漸","jiàn"],["歸妹","guī mèi"],["豐","fēng"],["旅","lǚ"],["巽","xùn"],["兌","duì"],["渙","huàn"],
  ["節","jié"],["中孚","zhōng fú"],["小過","xiǎo guò"],["既濟","jì jì"],["未濟","wèi jì"]
]

var tri_chars_arr = [
  ["Qian","乾"],["Dui","兌"],["Li","離"],["Zhen","震"],["Xun","巽"],["Kan","坎"],["Gen","艮"],["Kun","坤"]
]
var tri_lines_chars_arr = [ "☰","☱","☲","☳","☴","☵","☶","☷"]

var hex_lines_chars_arr = [
"&Omega;","䷁","䷀","䷂","䷃","䷄","䷅","䷆","䷇","䷈","䷉","䷊","䷋","䷌","䷍","䷎","䷏","䷐","䷑","䷒","䷓","䷔","䷕",
"䷖","䷗","䷘","䷙","䷚","䷛","䷜","䷝","䷞","䷟","䷠","䷡","䷢","䷣","䷤","䷥","䷦","䷧","䷨","䷩","䷪","䷫","䷬",
"䷭","䷮","䷯","䷰","䷱","䷲","䷳","䷴","䷵","䷶","䷷","䷸","䷹","䷺","䷻","䷼","䷽","䷾","䷿"
]
